package ru.job4j.example;

/* Это простая программа на Java.
 * Присвоить исходному файлу имя "Exaaple.java"
 * 1- вид : Многострочный коминтарий.( для вставки длинных примечаний)
 */
class Example {
    // Эта программа начинается с вызова метода main()
    // 2- вид : Однострочный коминтарий.(для коротких построчных коминтариев)
    public static void main(String args[]) {
        System.out.println("Простая программа на Java.");
        // System - обозначает предопределенный класс, предоставляющий доступ к системе.
        // out - поток вывода, связанный с консолью.
        // println - На самом деле вывод текста на экран выполняется встроенным методом println ().
    } // Первый символ } завершает метод main ().
} // а последний символ } - определение класса Example.