package ru.job4j.condition;

public class MultiMax {
    public int max(int first, int second, int third) {
        int result = first;
        if(second > first);
        if (third < second);
        // if ( нужно сравнивая попарно первое со втором и максимум из первого и второго сравнить с третьим числом.)
        // Как сравнить первое со вторым я вроде бы как понимаю,а вот что значит максимум из первого и второго - моей соображалки нихватает.
        // Вродебы ничегосложного,но вот как применить в этом задании этот оператор я ни догоняю.(переменная x = (выражение) ? значение if true : значение if false).
        return result;
    }
}